// SumDouble.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

const double EPS = 1e-6;
int main()
{
    double sum = 0;
    for (double i = -10; i <= 10; i += 0.1)
    {
        if (abs(i) < EPS)
            sum += 0;
        else
            sum += i;
        cout << i << endl;
    }
    cout << endl << sum << endl;

    double a = 46327.53637;
    double b = 46327.536379;

    if (a == b)
    {
        // Неправильно
    }
    if (abs(a - b) < EPS)
    {
        // Правильно
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
